myrottenpotatoes/app/controllers/movies_controller.rb

  def show
    if Movie.find_by_id(params[:id])==nil then
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

  def index
    #@movies=Movie.order('title').all
    @movies = Movie.all
---
SELECT "movies".* FROM "movies" ORDER BY title

  def create

    if params[:commit]=='Cancel' then
      redirect_to movies_path
    else
      @movie = Movie.create!(params[:movie])
---
INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find params[:id]
    if params[:commit]=='Cancel' then
      redirect_to movie_path(@movie)
    else
      @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "movies" SET "description" = 'lili', "updated_at" = '2013-05-07 15:07:41.277974' WHERE "movies"."id" = 12